#include "OS.h"

//显示命令目录
void commandCategory()
{
	textColor(10);
	cout << "--------------------------------------------------------------------------------" << endl;
	Sleep(20);    //程序延时100ms
	cout << "-----------                        命令提示                          -----------" << endl;
	Sleep(20);    //程序延时100ms
	cout << "---------------------------------文件/目录操作----------------------------------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "-----------  - 更名:     rname <O> <N>#  - 链接: link   <name>      ------------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "-----------  - 查找:     find  <name> #  - 剪切: cut    <name>       -----------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "-----------  - 复制:     copy  <name> #  - 粘贴: paste               -----------" << endl;
	Sleep(20);    //程序延时100ms
	cout << "---------------------------------目录操作---------------------------------------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "-----------  - 创建目录: mkdir <name> #  - 显示目录:     ls         ------------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "-----------  - 切换目录: cd    <name> #  - 返回根目录:   cd/        ------------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "-----------  - 删除目录: deld  <name> #  - 返回上级目录: cd..       ------------" << endl;
	Sleep(20);    //程序延时100ms
	cout << "----------------------------------文件操作--------------------------------------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "------------  - 创建文件: create <name>#  - 删除文件: delf <name>    -----------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "------------  - 改写文件: write <name> #  - 读取文件: read <name>    -----------" << endl;
	Sleep(20);    //程序延时100ms
	cout << "----------------------------------其他操作--------------------------------------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "------------  - 清屏:     cls          #  - 格式化:   format         -----------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "------------  - 注销登录: logout       #  - 位示图:   print          -----------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "------------  - 自动补全: Tab          #  - 关闭系统: exit           -----------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "------------  - 重新输入: ↑           #  - 显示帮助: help           -----------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "------------  - 修改密码: changepass   #  - 显示密码: showpassword   -----------" << endl;
	Sleep(10);    //程序延时100ms
	cout << "--------------------------------------------------------------------------------" << endl;
}

//界面主函数，用来实现大部分输入输出功能
void display() {

}

//用来检测命令是否存在以及指令的种类
int checkIn(string in)
{

}

//设置字体颜色
void textColor(int color) {
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), color);
}